Revit 2026 API

# FloorCreate(Document, IListCurveLoop, ElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Floor Create(
	Document document,
	IList<CurveLoop> profile,
	ElementId floorTypeId,
	ElementId levelId
)
```
```vb
Public Shared Function Create (
	document As Document,
	profile As IList(Of CurveLoop),
	floorTypeId As ElementId,
	levelId As ElementId
) As Floor
```
```cpp
public:
static Floor^ Create(
	Document^ document,
	IList<CurveLoop^>^ profile,
	ElementId^ floorTypeId,
	ElementId^ levelId
)
```
```fsharp
static member Create :
        document : Document *
        profile : IList<CurveLoop> *
        floorTypeId : ElementId *
        levelId : ElementId -> Floor
```

#### Parameters

document Document

profile IListCurveLoop

floorTypeId ElementId

levelId ElementId

#### Return Value

Floor

#### Reference

Floor Class

Create Overload

Autodesk.Revit.DB Namespace